-- Змінюємо структуру таблиці users
ALTER TABLE users
    ADD COLUMN date_of_birth DATE,
    ADD COLUMN driver_license_id VARCHAR(15) UNIQUE,
    DROP COLUMN passport_url;

ALTER TABLE users ALTER COLUMN date_of_birth DROP NOT NULL;
ALTER TABLE users ALTER COLUMN password TYPE VARCHAR(255);

-- Створюємо нові таблиці
CREATE TABLE IF NOT EXISTS reviews (
    id BIGSERIAL PRIMARY KEY,
    user_id BIGINT NOT NULL REFERENCES users(id) ON DELETE CASCADE,
    review_text TEXT NOT NULL
);

CREATE TABLE IF NOT EXISTS addresses (
    id BIGSERIAL PRIMARY KEY,
    country VARCHAR(50) NOT NULL,
    town VARCHAR(50) NOT NULL,
    user_id BIGINT NOT NULL REFERENCES users(id) ON DELETE CASCADE
);

-- Вставляємо дані
INSERT INTO users (first_name, last_name, date_of_birth, driver_license_id, email, password)
VALUES
('Артур', 'Остапенко', '1996-12-19', '5896590', 'test1@example.com', '4585748547'),
('Андрій', 'Опанасенко', '1997-12-19', '5896687', 'test2@example.com', '4585548547'),
('Ольгард', 'Мартиненко', '2001-10-16', '5863587', 'test3@example.com', '4185748547'),
('Алекса', 'Коваленко', '1999-12-27', '5842587', 'test4@example.com', '4581748547'),
('Арістарх', 'Адольфович', '1979-05-12', '5392587', 'test5@example.com', '4582748547'),
('Катерина', 'Коваленко', '1988-10-09', '5822587', 'test6@example.com', '4588348547'),
('Аліна', 'Смирнова', '1978-05-06', '5792517', 'test7@example.com', '4588788547');

INSERT INTO reviews (user_id, review_text) VALUES
(1, 'Пару років тому отримав водійські права, але власне авто ще не купив. Затестив GoGo. Є вибір автівок. Знайшов ту, що мені підходить. Депозит для початківців трохи вищий, але, думаю, це справедливо. Гроші з депозиту швидко повернули. Враження від поїздки і від самого додатку позитивні'),
(2, 'Каршерінг у Києві це щось нове. Спочатку було якось дивно відкривати машину через телефон без ключа, але згодом звик. Та й ключ, по суті, знаходиться в автомобілі, тому саме керування машиною відбувається, як завжди. Короче кажучи, рекомендую спробувати'),
(3, 'Скористався сервісом GoGo по рекомендації товариша. Машина їздить норм, паливо був майже повний бак, з відкриттям та закриттям машини через додаток проблем не виникло. В цілому, задоволений'),
(4, 'У мене є власний автомобіль, але час від часу віддаю його сестрі. Вирішила скористатись орендою авто через GoGo, коли виникла потреба поїхати у справах, а моя машина якраз була у неї. Не пошкодувала: легко знайшла вільне авто поблизу, всі документи і ключ знаходився у машині, та й сама машина виглядала доглянутою. Рекомендую GoGo тим, кому потрібне авто, але не таксі, а трохи на довший термін'),
(5, 'Як таксі тільки зручніше. Не треба чекати водія, ціни помірні'),
(6, 'Широкий вибір автомобілів. Від економ до преміум класу. Я користуюсь вже кілька місяців, і жодного разу не виникло проблем з машинами чи додатком. Рекомендую всім, хто шукає зручний спосіб оренди авто'),
(7, 'Зручно, що можна орендувати машину на годину або на день. Ідеально для поїздок по місту або на вихідні. Ціни адекватні, а вибір машин великий. Я вже кілька разів користувався GoGo і завжди залишався задоволений');

INSERT INTO addresses (country, town, user_id) VALUES
('Україна', 'Київ', 1),
('Україна', 'Львів', 2),
('Україна', 'Одеса', 3),
('Україна', 'Харків', 4),
('Україна', 'Київ', 5),
('Україна', 'Київ', 6),
('Україна', 'Одеса', 7);