INSERT INTO users (first_name, last_name, date_of_birth, driver_license_id, email, password)
VALUES
('Олег', 'Остапенко', '1996-12-19', '5896587', 'test1@example.com', '4585748547'),
('Олег', 'Опанасенко', '1997-12-19', '5896687', 'test2@example.com', '4585548547'),
('Олег', 'Мартиненко', '1997-10-16', '5893587', 'test3@example.com', '4185748547'),
('Олег', 'Коваленко', '1998-12-09', '5892587', 'test4@example.com', '4588748547');

INSERT INTO reviews (user_id, review_text) VALUES
(1, 'Пару років тому отримав водійські права, але власне авто ще не купив. Затестив GoGo. Є вибір автівок. Знайшов ту, що мені підходить. Депозит для початківців трохи вищий, але, думаю, це справедливо. Гроші з депозиту швидко повернули. Враження від поїздки і від самого додатку позитивні'),
(2, 'Каршерінг у Києві це щось нове. Спочатку було якось дивно відкривати машину через телефон без ключа, але згодом звик. Та й ключ, по суті, знаходиться в автомобілі, тому саме керування машиною відбувається, як завжди. Короче кажучи, рекомендую спробувати'),
(3, 'Скористався сервісом GoGo по рекомендації товариша. Машина їздить норм, паливо був майже повний бак, з відкриттям та закриттям машини через додаток проблем не виникло. В цілому, задоволений'),
(4, 'У мене є власний автомобіль, але час від часу віддаю його сестрі. Вирішила скористатись орендою авто через GoGo, коли виникла потреба поїхати у справах, а моя машина якраз була у неї. Не пошкодувала: легко знайшла вільне авто поблизу, всі документи і ключ знаходився у машині, та й сама машина виглядала доглянутою. Рекомендую GoGo тим, кому потрібне авто, але не таксі, а трохи на довший термін');